using CLIInterface.EGui;
using CLIInterface.Geometry;
using J2y.Interface;

namespace J2y
{
    namespace Danuri
    {
        //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
        //
        // JPanel
        //
        //      요약:
        //          패널 상속받기 위한 기본 클래스입니다.
        //
        //          패널 스크립트의 컨테이너는 무조건 EGuiPanel과 EGuiCollider를 포함해야 합니다. 
        //
        //          패널이 있는 컨테이너로 레이캐스트 후 마우스 포인트가 패널 위에 있으면 남은 오브젝트들의 레이캐스트를 실행합니다.
        //
        //          저작도구에서 패널을 만들어 사용할 때는 패널 안에 있는 모든 오브젝트가 패널 크기 안에 들어와야 합니다.
        //
        //          패널 밖으로 오브젝트가 나가게 될 경우 클리핑 옵션에 따라서 클리핑이 적용된 랜더링이 되지만 레이 캐스트의 경우 클리핑이 적용되지 않습니다.
        //
        //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

        public partial class JPanel : JActor, IPanelColliderHandler
        {
            //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
            // 변수
            //
            //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

            #region [변수] IPanelColliderHandler
            private EGuiPanel _eGuiPanel;
            private EGuiCollider _eGuiCollider;
            #endregion

            #region [변수] UseCollider
            private bool _useCollider = true;
            #endregion


            //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
            // Property
            //
            //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

            #region [Property] IPanelColliderHandler
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public BoundingBox Boundingbox => _eGuiCollider.GetWorldBox();
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public bool UseCollider
            {
                get => _useCollider;
                set => _useCollider = value;
            }
            #endregion

            #region [Property] EGuiPanel
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public EGuiPanel EGuiPanel => _eGuiPanel;
            #endregion

            //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
            // 기본 함수
            //
            //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

            #region [초기화] OnCreate
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public override int OnCreate()
            {
                base.OnCreate();

                _eGuiPanel = GetComponent<EGuiPanel>() ?? AddNewComponent<EGuiPanel>() as EGuiPanel;
                _eGuiCollider = GetComponent<EGuiCollider>() ?? AddNewComponent<EGuiCollider>() as EGuiCollider;

                return 0;
            }
            #endregion

            #region [정리] OnDestroy
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public override int OnDestroy()
            {
                base.OnDestroy();

                _eGuiPanel = null;
                _eGuiCollider = null;

                return 0;
            }
            #endregion

            #region [활성화] OnEnable
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public override int OnEnable()
            {
                base.OnEnable();

                return 0;
            }
            #endregion

            #region [비활성화] OnDisable
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public override int OnDisable()
            {
                base.OnDisable();

                return 0;
            }
            #endregion

            #region [업데이트] Update, LateUpdate
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public override void Update()
            {
                base.Update();

            }
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public override void LateUpdate()
            {
                base.LateUpdate();

            }
            #endregion


        }

    }
}
