using CLIInterface.EGui;
using CLIInterface.Geometry;
using J2y.Interface;


namespace J2y
{
    namespace Danuri
    {
        //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
        //
        // JWidget
        //
        //
        //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

        public class JWidget : JActor, IWidgetColliderHandler
        {
            //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
            // 변수
            //
            //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

            #region [변수] IWidgetColliderHandler
            private EGuiWidget _eGuiWidget;
            private EGuiCollider _eGuiCollider;
            #endregion

            #region [변수] UseCollider
            private bool _useCollider = true;
            #endregion


            //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
            // Property
            //
            //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

            #region [Property] IWidgetColliderHandler

            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public BoundingBox Boundingbox => _eGuiCollider.GetWorldBox();
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public bool UseCollider
            {
                get => _useCollider;
                set => _useCollider = value;
            }
            #endregion

            #region [Property] EGuiWidget

            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public EGuiWidget EGuiWidget => _eGuiWidget;
            #endregion


            //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
            // 기본 함수
            //
            //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

            #region [초기화] OnCreate
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public override int OnCreate()
            {
                base.OnCreate();

                _eGuiWidget = GetComponent<EGuiWidget>() ?? AddNewComponent<EGuiWidget>() as EGuiWidget;
                _eGuiCollider = GetComponent<EGuiCollider>() ?? AddNewComponent<EGuiCollider>() as EGuiCollider;

                return 0;
            }
            #endregion

            #region [정리] OnDestroy
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public override int OnDestroy()
            {
                base.OnDestroy();

                _eGuiWidget = null;
                _eGuiCollider = null;

                return 0;
            }
            #endregion

            #region [활성화] OnEnable
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public override int OnEnable()
            {
                base.OnEnable();

                return 0;
            }
            #endregion

            #region [비활성화] OnDisable
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public override int OnDisable()
            {
                base.OnDisable();

                return 0;
            }
            #endregion

            #region [업데이트] Update, LateUpdate
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public override void Update()
            {
                base.Update();

            }
            //------------------------------------------------------------------------------------------------------------------------------------------------------
            public override void LateUpdate()
            {
                base.LateUpdate();

            }
            #endregion
        }

    }
}
